clemarfolly/flashfloppy/src/display/lcd_stm32f411.c
/*
 * lcd_stm32f411.c
 *
 * 1. HD44780 LCD controller via a PCF8574 I2C backpack.
 * 2. SSD1306 OLED controller driving 128x32 bitmap display.
 *
 * Written & released by Keir Fraser <keir.xen@gmail.com>
 * Adapted for STM32F411 (I2C v1 peripheral)
 *
 * This is free and unencumbered software released into the public domain.
 * See the file COPYING for more details, or visit <http://unlicense.org>.
 */

#include <stdint.h>
#include "mcu/stm32f411.h"
#include "mcu/stm32f411_regs.h"
#include "types.h"

/* PCF8574 pin assignment: D7-D6-D5-D4-BL-EN-RW-RS */
#define _D7 (1u<<7)
#define _D6 (1u<<6)
#define _D5 (1u<<5)
#define _D4 (1u<<4)
#define _BL (1u<<3)
#define _EN (1u<<2)
#define _RW (1u<<1)
#define _RS (1u<<0)

/* HD44780 commands */
#define CMD_ENTRYMODE    0x04
#define CMD_DISPLAYCTL   0x08
#define CMD_DISPLAYSHIFT 0x10
#define CMD_FUNCTIONSET  0x20
#define CMD_SETCGRADDR   0x40
#define CMD_SETDDRADDR   0x80
#define FS_2LINE         0x08

/* FF OSD command set */
#define OSD_BACKLIGHT    0x00
#define OSD_DATA         0x02
#define OSD_ROWS         0x10
#define OSD_HEIGHTS      0x20
#define OSD_BUTTONS      0x30
#define OSD_COLUMNS      0x40
struct packed i2c_osd_info {
    uint8_t protocol_ver;
    uint8_t fw_major, fw_minor;
    uint8_t buttons;
};

/* STM32 I2C peripheral. */
#define i2c i2c2

#define i2c_gpio gpiob
#define SCL 10      // PB10
#define SCL_AF 4    // Alternate function 4
#define SDA 3       // PB3
#define SDA_AF 9    // Alternate function 9

/* I2C error ISR. */
#define I2C_ERROR_IRQ 34
void IRQ_34(void) __attribute__((alias("IRQ_i2c_error")));

/* I2C event ISR. */
#define I2C_EVENT_IRQ 33
void IRQ_33(void) __attribute__((alias("IRQ_i2c_event")));

/* DMA1 Stream 7, Channel 7 -> I2C2_TX */
#define DMA_TX_STREAM 7
#define DMA_TX_CH 7
#define i2c_tx_dma dma1->stream[DMA_TX_STREAM]

/* DMA1 Stream 3, Channel 7 -> I2C2_RX */
#define DMA_RX_STREAM 3
#define DMA_RX_CH 7
#define i2c_rx_dma dma1->stream[DMA_RX_STREAM]

/* SR1 error flags */
#define I2C_SR1_ERRORS (I2C_SR1_BERR | I2C_SR1_ARLO | I2C_SR1_AF | \
                        I2C_SR1_OVR  | I2C_SR1_TIMEOUT)

/* APB1 = 50MHz on STM32F411 @ 100MHz.
 * Standard mode 100kHz: CCR = 50MHz / (2 * 100kHz) = 250.
 * TRISE = 50MHz * 1000ns + 1 = 51. */
#define I2C_CCR_100k  I2C_CCR_CCR(250)
#define I2C_TRISE_100k 51

/* Fast mode 400kHz, DUTY=0: CCR = 50MHz / (3 * 400kHz) = 42.
 * TRISE = 50MHz * 300ns + 1 = 16. */
#define I2C_CCR_400k  (I2C_CCR_FS | I2C_CCR_CCR(42))
#define I2C_TRISE_400k 16

bool_t has_osd;
uint8_t osd_buttons_tx;
uint8_t osd_buttons_rx;
#define OSD_no    0
#define OSD_read  1
#define OSD_write 2
static uint8_t in_osd, osd_ver;
#define OSD_I2C_ADDR 0x10

static uint8_t _bl;
static uint8_t i2c_addr;
static uint8_t i2c_dead;
static uint8_t i2c_row;
static bool_t is_oled_display;
static uint8_t oled_height;

/* Tracks whether current DMA transfer is RX or TX, for the event ISR. */
static bool_t i2c_dma_rd;

#define OLED_ADDR 0x3c
enum { OLED_unknown, OLED_ssd1306, OLED_sh1106 };
static uint8_t oled_model;
static void oled_init(void);
static unsigned int oled_prep_buffer(void);

#define I2C_RD TRUE
#define I2C_WR FALSE
static void i2c_start(uint8_t a, unsigned int nr, bool_t rd);

static void i2c_tx_tc(void);
static void i2c_rx_tc(void);

static volatile uint8_t refresh_count;

static uint8_t buffer[256] aligned(4);
static char text[4][40];

uint8_t lcd_columns, lcd_rows;

uint8_t display_mode = DM_banner;
#define menu_mode (display_mode == DM_menu)

#define DMA_TIMEOUT time_ms(200)
static struct timer timeout_timer;
static void timeout_fn(void *unused)
{
    IRQx_set_pending(I2C_ERROR_IRQ);
}

/* I2C Error ISR: Reset the peripheral and reinit everything. */
static void IRQ_i2c_error(void)
{
    /* Read and clear SR1 error flags (write 0 to clear). */
    uint16_t sr1 = i2c->sr1;
    printk("I2C: Error (%04x)\n", (uint16_t)(sr1 & I2C_SR1_ERRORS));
    i2c->sr1 = sr1 & ~I2C_SR1_ERRORS;

    /* Reset the I2C peripheral via SWRST. */
    i2c->cr1 = I2C_CR1_SWRST;
    i2c->cr1 = 0;

    /* Clear DMA channels. */
    i2c_tx_dma.cr = i2c_rx_dma.cr = 0;

    timer_cancel(&timeout_timer);

    lcd_init();
}

/*
 * I2C Event ISR.
 *
 * On I2C v1 the DMA handles the data bytes. We only need the event ISR to:
 *  - detect ADDR (start+address ACKed): clear by reading SR1 then SR2
 *  - detect BTF/STOPF after last DMA byte (DMA sets CR2_LAST so the
 *    peripheral generates NACK+STOP automatically on the final RX byte,
 *    and we get a BTF on TX after the last byte).
 *  - detect AF (NACK from slave) as an error.
 */
static void IRQ_i2c_event(void)
{
    uint16_t sr1 = i2c->sr1;

    if (sr1 & I2C_SR1_ERRORS) {
        IRQx_set_pending(I2C_ERROR_IRQ);
        return;
    }

    if (sr1 & I2C_SR1_ADDR) {
        /* Clear ADDR flag by reading SR1 (done) then SR2. */
        (void)i2c->sr2;
        return;
    }

    if (sr1 & I2C_SR1_BTF) {
        /* TX: all bytes sent, DMA complete - generate STOP. */
        if (!i2c_dma_rd) {
            i2c->cr1 |= I2C_CR1_STOP;
            i2c_tx_tc();
        }
        return;
    }

    if (sr1 & I2C_SR1_STOPF) {
        /* RX stop detected (set by hardware after NACK on last byte). */
        /* Clear STOPF: read SR1 (done above) then write CR1. */
        i2c->cr1 |= I2C_CR1_PE;
        i2c_rx_tc();
    }
}

/* Start an I2C DMA sequence. */
static void dma_start(unsigned int sz)
{
    unsigned int addr = in_osd ? OSD_I2C_ADDR : i2c_addr;

    ASSERT(sz <= sizeof(buffer));

    i2c_dma_rd = (in_osd == OSD_read);

    /* Disable I2C before reconfiguring. */
    i2c->cr1 &= ~I2C_CR1_PE;

    if (i2c_dma_rd) {

        /* RX path */
        i2c_rx_dma.cr = 0;
        i2c_rx_dma.ndtr = sz;
        i2c_rx_dma.m0ar = (uint32_t)(unsigned long)buffer;
        i2c_rx_dma.par  = (uint32_t)(unsigned long)&i2c->dr;
        i2c_rx_dma.cr   = (DMA_CR_CHSEL(DMA_RX_CH)   |
                           DMA_SxCR_MSIZE_8BIT  |
                           DMA_SxCR_PSIZE_8BIT  |
                           DMA_SxCR_MINC        |
                           DMA_SxCR_DIR_P2M     |
                           DMA_SxCR_EN);


        /* Enable I2C with DMA, ACK, LAST (auto-NACK on last byte). */
        i2c->cr1 = (I2C_CR1_PE | I2C_CR1_ACK);
        i2c->cr2 = (I2C_CR2_FREQ(50) | I2C_CR2_DMAEN |
                    I2C_CR2_LAST    | I2C_CR2_ITEVTEN |
                    I2C_CR2_ITERREN);

    } else {

