clemarfolly/flashfloppy/src/display/lcd_stm32f411.c
        /* TX path */
        i2c_tx_dma.cr = 0;
        i2c_tx_dma.ndtr = sz;
        i2c_tx_dma.m0ar = (uint32_t)(unsigned long)buffer;
        i2c_tx_dma.par  = (uint32_t)(unsigned long)&i2c->dr;
        i2c_tx_dma.cr   = (DMA_CR_CHSEL(DMA_TX_CH)   |
                           DMA_SxCR_MSIZE_8BIT  |
                           DMA_SxCR_PSIZE_8BIT  |
                           DMA_SxCR_MINC        |
                           DMA_SxCR_DIR_M2P     |
                           DMA_SxCR_EN);

        /* Enable I2C with DMA. */
        i2c->cr1 = I2C_CR1_PE;
        i2c->cr2 = (I2C_CR2_FREQ(50) | I2C_CR2_DMAEN |
                    I2C_CR2_ITEVTEN  | I2C_CR2_ITERREN);
    }

    /* Kick off the START condition (triggers SB -> ADDR -> DMA). */
    i2c_start(addr, sz, i2c_dma_rd);

    timer_set(&timeout_timer, time_now() + DMA_TIMEOUT);
}

static void emit4(uint8_t **p, uint8_t val)
{
    *(*p)++ = val;
    *(*p)++ = val | _EN;
    *(*p)++ = val;
}

static void emit8(uint8_t **p, uint8_t val, uint8_t signals)
{
    signals |= _bl;
    emit4(p, (val & 0xf0) | signals);
    emit4(p, (val << 4) | signals);
}

static unsigned int osd_prep_buffer(void)
{
    uint16_t order = menu_mode ? 0x7903 : 0x7183;
    char *p;
    uint8_t *q = buffer;
    unsigned int row, rows, heights;
    int i;

    if (++in_osd == OSD_read) {
        memset(buffer, 0x11, sizeof(struct i2c_osd_info));
        return sizeof(struct i2c_osd_info);
    }

    if ((ff_cfg.osd_display_order != DORD_default)
        && (display_mode == DM_normal))
        order = ff_cfg.osd_display_order;

    heights = rows = 0;
    for (i = 3; i >= 0; i--) {
        row = order >> (i<<2);
        if ((rows == 0) && ((row&7) == 7))
            continue;
        rows++;
        heights <<= 1;
        if (row & 8)
            heights |= 1;
    }

    *q++ = OSD_BACKLIGHT | !!_bl;
    *q++ = OSD_COLUMNS | lcd_columns;
    *q++ = OSD_ROWS | rows;
    *q++ = OSD_HEIGHTS | heights;
    *q++ = OSD_BUTTONS | osd_buttons_tx;
    *q++ = OSD_DATA;
    for (row = 0; row < rows; row++) {
        p = text[(order >> (row * DORD_shift)) & DORD_row];
        memcpy(q, p, lcd_columns);
        q += lcd_columns;
    }

    if (i2c_addr == 0)
        refresh_count++;

    in_osd = OSD_write;

    return q - buffer;
}

static unsigned int lcd_prep_buffer(void)
{
    const static uint8_t row_offs[] = { 0x00, 0x40, 0x14, 0x54 };
    uint16_t order;
    char *p;
    uint8_t *q = buffer;
    unsigned int i, row;

    if (i2c_row == lcd_rows) {
        i2c_row++;
        if (has_osd)
            return osd_prep_buffer();
    }

    if (i2c_row > lcd_rows) {
        i2c_row = 0;
        refresh_count++;
    }

    order = (lcd_rows == 2) ? 0x7710 : 0x2103;
    if ((ff_cfg.display_order != DORD_default) && (display_mode == DM_normal))
        order = ff_cfg.display_order;

    row = (order >> (i2c_row * DORD_shift)) & DORD_row;
    p = (_bl && row < ARRAY_SIZE(text)) ? text[row] : NULL;

    emit8(&q, CMD_SETDDRADDR | row_offs[i2c_row], 0);
    for (i = 0; i < lcd_columns; i++)
        emit8(&q, p ? *p++ : ' ', _RS);

    i2c_row++;

    return q - buffer;
}

static void i2c_tx_tc(void)
{
    unsigned int dma_sz;

    in_osd = OSD_no;
    if (i2c_addr == 0) {
        dma_sz = osd_prep_buffer();
    } else {
        dma_sz = is_oled_display ? oled_prep_buffer() : lcd_prep_buffer();
    }
    dma_start(dma_sz);
}

static void i2c_rx_tc(void)
{
    struct i2c_osd_info *info = (struct i2c_osd_info *)buffer;

    osd_buttons_rx = info->buttons;

    dma_start(osd_prep_buffer());
}

/* Wait for SR1 flag(s) while checking for errors. */
static bool_t i2c_wait(uint16_t s)
{
    stk_time_t t = stk_now();
    
    while ((i2c->sr1 & s) != s) {
        if (i2c->sr1 & I2C_SR1_ERRORS) {
            i2c->sr1 = i2c->sr1 & ~I2C_SR1_ERRORS;
            return FALSE;
        }
        if (stk_diff(t, stk_now()) > stk_ms(10)) {
            i2c_dead = TRUE;
            return FALSE;
        }
    }
    return TRUE;
}

/*
 * Initiate an I2C transfer (synchronous START + address phase).
 * On I2C v1: set START, wait for SB, write address byte to DR,
 * wait for ADDR, then clear by reading SR2.
 */
static void i2c_start(uint8_t a, unsigned int nr, bool_t rd)
{
    /* Generate START condition. */
    i2c->cr1 |= I2C_CR1_START;

    /* Wait for SB (start bit sent). */
    if (!i2c_wait(I2C_SR1_SB))
        return;

    /* Send address byte: LSB=1 for read, LSB=0 for write. */
    i2c->dr = (a << 1) | (rd ? 1 : 0);

    /* Wait for ADDR (address ACKed by slave). */
    if (!i2c_wait(I2C_SR1_ADDR))
        return;

    /* Clear ADDR flag: read SR1 (done in i2c_wait) then SR2. */
    (void)i2c->sr2;
}

/* Synchronously generate STOP and wait for bus idle. */
static bool_t i2c_stop(void)
{
    stk_time_t t = stk_now();

    i2c->cr1 |= I2C_CR1_STOP;
    /* Wait until STOP condition is cleared by hardware (bus free). */
    while (i2c->cr1 & I2C_CR1_STOP) {
        if (stk_diff(t, stk_now()) > stk_ms(10)) {
            i2c_dead = TRUE;
            return FALSE;
        }
    }
    return TRUE;
}

/* Synchronously transmit one byte. */
static bool_t i2c_sync_write(uint8_t b)
{
    if (!i2c_wait(I2C_SR1_TXE))
        return FALSE;
    i2c->dr = b;
    return TRUE;
}

/* Synchronously receive one byte. */
static bool_t i2c_sync_read(uint8_t *pb)
{
    if (!i2c_wait(I2C_SR1_RXNE))
        return FALSE;
    *pb = i2c->dr;
    return TRUE;
}

static bool_t i2c_sync_write_txn(uint8_t addr, uint8_t *cmds, unsigned int nr)
{
    unsigned int i;

    /* Set up for synchronous TX (no DMA, no IRQ). */
    i2c->cr1 = I2C_CR1_PE;
    i2c->cr2 = I2C_CR2_FREQ(50);

    i2c_start(addr, nr, I2C_WR);

    for (i = 0; i < nr; i++)
        if (!i2c_sync_write(*cmds++))
            return FALSE;

    /* Wait for BTF (last byte fully shifted out) before STOP. */
    if (!i2c_wait(I2C_SR1_BTF))
        return FALSE;

    return i2c_stop();
}

static bool_t i2c_sync_read_txn(uint8_t addr, uint8_t *rsp, unsigned int nr)
{
    unsigned int i;

