clemarfolly/flashfloppy/src/display/lcd_stm32f411.c
    i2c->cr1 = (I2C_CR1_PE | I2C_CR1_ACK);
    i2c->cr2 = I2C_CR2_FREQ(50);

    i2c_start(addr, nr, I2C_RD);

    for (i = 0; i < nr; i++) {
        /* On last byte: clear ACK and set STOP before reading DR,
         * so the peripheral NACKs the last byte as required by I2C. */
        if (i == (nr - 1))
            i2c->cr1 = (I2C_CR1_PE | I2C_CR1_STOP);
        if (!i2c_sync_read(rsp + i))
            return FALSE;
    }

    return TRUE;
}

static void write4(uint8_t val)
{
    i2c_sync_write(val);
    i2c_sync_write(val | _EN);
    i2c_sync_write(val);
}

static bool_t i2c_probe(uint8_t a)
{
    i2c->cr1 = I2C_CR1_PE;
    i2c->cr2 = I2C_CR2_FREQ(50);

    i2c->cr1 |= I2C_CR1_START;
    if (!i2c_wait(I2C_SR1_SB))
        return FALSE;

    /* Send address for write; if slave NACKs, AF will be set. */
    i2c->dr = (a << 1);
    if (!i2c_wait(I2C_SR1_ADDR)) {
        /* Clear AF. */
        i2c->sr1 = i2c->sr1 & ~I2C_SR1_AF;
        i2c->cr1 |= I2C_CR1_STOP;
        return FALSE;
    }
    (void)i2c->sr2;

    i2c->cr1 |= I2C_CR1_STOP;
    return TRUE;
}

static uint8_t i2c_probe_range(uint8_t s, uint8_t e)
{
    uint8_t a;
    for (a = s; (a <= e) && !i2c_dead; a++)
        if (i2c_probe(a))
            return a;
    return 0;
}

void lcd_clear(void)
{
    memset(text, ' ', sizeof(text));
}

void lcd_write(int col, int row, int min, const char *str)
{
    char c, *p;
    uint32_t oldpri;

    if (min < 0)
        min = lcd_columns;

    p = &text[row][col];

    oldpri = IRQ_save(I2C_IRQ_PRI);

    while ((c = *str++) && (col++ < lcd_columns)) {
        *p++ = c;
        min--;
    }
    while ((min-- > 0) && (col++ < lcd_columns))
        *p++ = ' ';

    IRQ_restore(oldpri);
}

void lcd_backlight(bool_t on)
{
    _bl = on ? _BL : 0;
}

void lcd_sync(void)
{
    uint8_t c = refresh_count;
    while ((uint8_t)(refresh_count - c) < 2)
        cpu_relax();
}

bool_t lcd_init(void)
{
    uint8_t a, *p;
    bool_t reinit = (i2c_addr != 0) || has_osd;

    i2c_dead = FALSE;
    i2c_row = 0;
    in_osd = OSD_no;
    osd_buttons_rx = 0;

    rcc->apb1enr |= RCC_APB1ENR_I2C2EN;

    gpio_configure_pin(i2c_gpio, SCL, GPO_opendrain(_2MHz, HIGH));
    gpio_configure_pin(i2c_gpio, SDA, GPO_opendrain(_2MHz, HIGH));
    delay_us(10);
    if (gpio_read_pin(i2c_gpio, SCL) && !gpio_read_pin(i2c_gpio, SDA)) {
        printk("I2C: SDA held by slave? Fixing... ");
        gpio_write_pin(i2c_gpio, SDA, FALSE);
        gpio_write_pin(i2c_gpio, SCL, FALSE);
        delay_us(10);
        gpio_write_pin(i2c_gpio, SCL, TRUE);
        delay_us(10);
        gpio_write_pin(i2c_gpio, SDA, TRUE);
        delay_us(10);
        printk("%s\n",
               !gpio_read_pin(i2c_gpio, SCL) || !gpio_read_pin(i2c_gpio, SDA)
               ? "Still held" : "Done");
    }

    if (!reinit) {
        bool_t scl, sda;
        gpio_configure_pin(i2c_gpio, SCL, GPI_pull_down);
        gpio_configure_pin(i2c_gpio, SDA, GPI_pull_down);
        delay_us(10);
        scl = gpio_read_pin(i2c_gpio, SCL);
        sda = gpio_read_pin(i2c_gpio, SDA);
        if (!scl || !sda) {
            printk("I2C: Invalid bus SCL=%u SDA=%u\n", scl, sda);
            goto fail;
        }
    }

    gpio_set_af(i2c_gpio, SCL, SCL_AF);
    gpio_set_af(i2c_gpio, SDA, SDA_AF);
    gpio_configure_pin(i2c_gpio, SCL, AFO_opendrain(_2MHz));
    gpio_configure_pin(i2c_gpio, SDA, AFO_opendrain(_2MHz));

    /* Reset and configure I2C for Standard Mode (100kHz).
     * APB1 = 50MHz on STM32F411 @ 100MHz system clock. */
    i2c->cr1 = I2C_CR1_SWRST;
    i2c->cr1 = 0;
    i2c->cr2 = I2C_CR2_FREQ(50);
    i2c->ccr = I2C_CCR_100k;
    i2c->trise = I2C_TRISE_100k;
    i2c->cr1 = I2C_CR1_PE;

    if (!reinit) {

        (void)i2c_probe(0);

        has_osd = i2c_probe(OSD_I2C_ADDR);
        a = i2c_probe_range(0x20, 0x27) ?: i2c_probe_range(0x38, 0x3f);
        if ((a == 0) && (i2c_dead || !has_osd
                         || ((ff_cfg.display_type & 3) != DISPLAY_auto))) {
            printk("I2C: %s\n",
                   i2c_dead ? "Bus locked up?" : "No device found");
            has_osd = FALSE;
            goto fail;
        }

        if (has_osd) {
            (void)i2c_sync_read_txn(OSD_I2C_ADDR, &osd_ver, 1);
            printk("I2C: FF OSD found (ver %x)\n", osd_ver);
        }

        is_oled_display = (ff_cfg.display_type & DISPLAY_oled) ? TRUE
            : (ff_cfg.display_type & DISPLAY_lcd) ? FALSE
            : ((a&~1) == OLED_ADDR);

        if (is_oled_display) {
            oled_height = (ff_cfg.display_type & DISPLAY_oled_64) ? 64 : 32;
            lcd_columns = (ff_cfg.oled_font == FONT_8x16) ? 16
                : (ff_cfg.display_type & DISPLAY_narrower) ? 16
                : (ff_cfg.display_type & DISPLAY_narrow) ? 18 : 21;
            lcd_rows = 4;
        } else {
            lcd_columns = (ff_cfg.display_type >> _DISPLAY_lcd_columns) & 63;
            lcd_rows = (ff_cfg.display_type >> _DISPLAY_lcd_rows) & 7;
        }

        if (a != 0) {
            printk("I2C: %s found at 0x%02x\n",
                   is_oled_display ? "OLED" : "LCD", a);
            i2c_addr = a;
        } else {
            is_oled_display = FALSE;
            lcd_columns = ff_cfg.osd_columns;
        }

        lcd_columns = max_t(uint8_t, lcd_columns, 16);
        lcd_columns = min_t(uint8_t, lcd_columns, 40);
        lcd_rows = max_t(uint8_t, lcd_rows, 2);
        lcd_rows = min_t(uint8_t, lcd_rows, 4);

        lcd_clear();
    }

    /* Enable the Event IRQ. */
    IRQx_set_prio(I2C_EVENT_IRQ, I2C_IRQ_PRI);
    IRQx_clear_pending(I2C_EVENT_IRQ);
    IRQx_enable(I2C_EVENT_IRQ);

    /* Enable the Error IRQ. */
    IRQx_set_prio(I2C_ERROR_IRQ, I2C_IRQ_PRI);
    IRQx_clear_pending(I2C_ERROR_IRQ);
    IRQx_enable(I2C_ERROR_IRQ);

    /* STM32F411: DMA1 ch4=I2C2_TX, ch5=I2C2_RX — no DMAMUX needed. */

    /* Initialise DMA1 channel 4 for I2C2 TX. */
    i2c_tx_dma.m0ar = (uint32_t)(unsigned long)buffer;
    i2c_tx_dma.par = (uint32_t)(unsigned long)&i2c->dr;

    /* Initialise DMA1 channel 5 for I2C2 RX. */
    i2c_rx_dma.m0ar = (uint32_t)(unsigned long)buffer;
    i2c_rx_dma.par = (uint32_t)(unsigned long)&i2c->dr;

