clemarfolly/flashfloppy/src/display/lcd_stm32f411.c
fail:
    return FALSE;
}

static void oled_init_fast_mode(void)
{
    /* Switch to Fast Mode (400kHz). */
    i2c->cr1 = 0;
    i2c->cr2 = I2C_CR2_FREQ(50);
    i2c->ccr = I2C_CCR_400k;
    i2c->trise = I2C_TRISE_400k;
    i2c->cr1 = I2C_CR1_PE;
}

static void oled_init(void)
{
    static const uint8_t init_cmds[] = {
        0xd5, 0x80,
        0xd3, 0x00,
        0x40,
        0x8d, 0x14,
        0xda, 0x02,
        0xd9, 0xf1,
        0xdb, 0x20,
        0xa4,
        0x2e,
    }, norot_cmds[] = {
        0xa1,
        0xc8,
    }, rot_cmds[] = {
        0xa0,
        0xc0,
    };
    uint8_t dynamic_cmds[7], *dc;
    uint8_t *p = buffer;

    if (!(ff_cfg.display_type & DISPLAY_slow))
        oled_init_fast_mode();

    if ((oled_model == OLED_unknown) && !oled_probe_model())
        goto fail;

    p += oled_queue_cmds(p, init_cmds, sizeof(init_cmds));

    dc = dynamic_cmds;
    *dc++ = (ff_cfg.display_type & DISPLAY_inverse) ? 0xa7 : 0xa6;
    *dc++ = 0x81;
    *dc++ = ff_cfg.oled_contrast;
    *dc++ = 0xa8;
    *dc++ = oled_height - 1;
    *dc++ = 0xda;
    *dc++ = (oled_height == 64) ? 0x12 : 0x02;
    p += oled_queue_cmds(p, dynamic_cmds, dc - dynamic_cmds);

    dc = dynamic_cmds;
    memcpy(dc, (ff_cfg.display_type & DISPLAY_rotate) ? rot_cmds : norot_cmds,
           2);
    if (ff_cfg.display_type & DISPLAY_hflip)
        dc[0] ^= 1;
    p += oled_queue_cmds(p, dc, 2);

    p += oled_start_i2c(p);

    dma_start(p - buffer);
    return;

fail:
    IRQx_set_pending(I2C_ERROR_IRQ);
}

/*
 * Local variables:
 * mode: C
 * c-file-style: "Linux"
 * c-basic-offset: 4
 * tab-width: 4
 * indent-tabs-mode: nil
 * End:
 */